# select the data form the db table 
# select * from users;
# select username, email from users;

# UPDATE users 
# set email = "ramhari@gmail.com", username = "ramhari"
# where id = 4;

# select * from users;

# where 
# DELETE from users 
# where username ="laxman";

# select * from users;

# where -> if 
# select * from users
# where username = "hari";

#SELECT * from users
#where created_at < '2025-07-10 09:29:16';

# select * from category;
# insert into category (title)
# values("education"), ("news"), ("Office"), ("entertainment"), ("national news");
# select * from category;

#select * from blog;
#insert into blog (title, description, user_id, category_id)
#VALUES ("आज आदिकवि भानुभक्तको २१२औँ जन्मजयन्ती मनाइँदै", "काठमाडौँ — नेपाली साहित्यका आदिकवि भानुभक्त आचार्यको २१२औँ जन्मजयन्ती आज देश तथा विदेशका विभिन्न स्थानमा विविध कार्यक्रमको आयोजना गरी मनाइँदैछ । संस्कृत भाषामा लेखिएको अयोध्याका राजा रामको जीवनीलाई भावानुवादसहितको ‘रामायण’ प्रस्तुत गरेर भानुभक्तले नेपाली साहित्यमा महत्त्वपूर्ण योगदान गरेका थिए।", "1", "1"),("गाजामा इन्धन आपूर्ति न्यून : राष्ट्रसंघ", "संयुक्त राष्ट्रसंघको मानवीय मामिला समन्वय कार्यालय (ओसीएचए) का अनुसार, गाजामा दैनिक रूपमा लाखौं लिटर इन्धन आवश्यक पर्दछ, जसको प्रयोग स्वास्थ्य सेवा, खानेपानी आपूर्ति, सरसफाइ तथा आपत्कालीन सेवाका सञ्चालनका लागि अत्यावश्यक मानिन्छ । चार महिनाभन्दा लामो समयदेखि जारी इन्धन प्रतिबन्धका कारण गाजामा सेवा प्रवाहमा गम्भीर असर परेको ओसीएचएले जनाएको छ ।‘गाजामा इन्धनको अभाव अत्यन्त चिन्ताजनक अवस्थामा पुगेको छ,’ ओसीएचएद्वारा जारी विज्ञप्तिमा भनिएको छ, ‘नियमित रूपमा पर्याप्त मात्रामा इन्धन आपूर्ति हुन सकेन भने धेरै जीवनरक्षक सेवाहरू पूर्णरूपमा बन्द हुने खतरा छ ।’ इन्धन वितरण प्रयास दक्षिण गाजामा मात्र सीमित रहेको बताउँदै ओसीएचएले उत्तर गाजातर्फ पुर्‍याउने अनुमति इजरायलले प्रदान नगरेको बताएको छ । ‘उत्तर गाजामा रहेका अस्पतालहरू बन्द हुने स्थितिमा छन्, एम्बुलेन्स सेवा, खानेपानी प्रशोधन केन्द्र र अन्य अत्यावश्यक सेवामा पनि इन्धनको अत्यधिक अभाव छ,’ ओसीएचएले भनेको छ । भोक, प्यास र उपचारको खोजीमा रहेका गाजाका सर्वसाधारण सहायता लिन जाँदा पनि गोली लागेर ज्यान गुमाइरहेका छन् । यसले घाइतेको उद्धार, जोखिमयुक्त क्षेत्रबाट सर्वसाधारणको स्थानान्तरण र स्वास्थ्य उपकरणको मूल्यांकनजस्ता महत्त्वपूर्ण कामहरू प्रभावित पारेको ओसीएचएले जनाएको छ । बुधबार गाजा सहरको एक क्षेत्रमा १८ जना घाइते भग्नावशेषमा फसेको सूचना पाएर उद्धार टोली पठाउने अनुमति मागिएको थियो । तर अनुमति ढिला भई बिहीबार मात्र पुग्दा कोही पनि जीवित भेटिएनन् ।:", 4, 2);

# SELECT * from category
# order BY id DESC;

# SELECT category_id, COUNT(*) AS NumberofCategory
# FROM blog
# GROUP BY id;

SELECT category_id, COUNT(*) AS NumberOfCategory
FROM blog
GROUP BY id
HAVING COUNT(*) > 1;